# Decision Tree Exercises

In [1]:
import warnings
warnings.filterwarnings("ignore")

import numpy as np

from pydataset import data

from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier, plot_tree
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix


import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
import acquire 
import prepare

### 1 What is your baseline prediction? What is your baseline accuracy? remember: your baseline prediction for a classification problem is predicting the most prevelant class in the training dataset (the mode). When you make those predictions, what is your accuracy? This is your baseline accuracy.

#### - my baseline prediction is that men had a higher mortality rate than women in the sinking of the titanic

In [2]:
df = acquire.get_titanic_data()

In [3]:
df = df.drop(columns = 'deck')

In [4]:
df.embark_town = df.embark_town.fillna(value=df.embark_town.mode())

In [5]:
df.age = df.age.fillna(value=df.age.median())

In [6]:
dummy_df = pd.get_dummies(df[['sex', 'embark_town']] , dummy_na = False, drop_first = [True, True])

df = df.drop(columns = ['sex', 'embark_town'])

df = pd.concat([df, dummy_df] , axis = 1)

df.head()

,passenger_id,survived,pclass,age,sibsp,parch,fare,embarked,class,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,22.0,1,0,7.2500,S,Third,0,1,0,1
1,1,1,1,38.0,1,0,71.2833,C,First,0,0,0,0
2,2,1,3,26.0,0,0,7.9250,S,Third,1,0,0,1
3,3,1,1,35.0,1,0,53.1000,S,First,0,0,0,1
4,4,0,3,35.0,0,0,8.0500,S,Third,1,1,0,1

In [7]:
df.drop(columns = ['embarked' , 'class'] , inplace = True, axis = 1)
df

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,22.0,1,0,7.2500,0,1,0,1
1,1,1,1,38.0,1,0,71.2833,0,0,0,0
2,2,1,3,26.0,0,0,7.9250,1,0,0,1
3,3,1,1,35.0,1,0,53.1000,0,0,0,1
4,4,0,3,35.0,0,0,8.0500,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,27.0,0,0,13.0000,1,1,0,1
887,887,1,1,19.0,0,0,30.0000,1,0,0,1
888,888,0,3,28.0,1,2,23.4500,0,0,0,1
889,889,1,1,26.0,0,0,30.0000,1,1,0,0
890,890,0,3,32.0,0,0,7.7500,1,1,1,0

In [8]:
df.head()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,3,22.0,1,0,7.2500,0,1,0,1
1,1,1,1,38.0,1,0,71.2833,0,0,0,0
2,2,1,3,26.0,0,0,7.9250,1,0,0,1
3,3,1,1,35.0,1,0,53.1000,0,0,0,1
4,4,0,3,35.0,0,0,8.0500,1,1,0,1

In [9]:
train, test = train_test_split(df, test_size=.2, random_state=123, stratify=df.survived)
train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.survived)

In [10]:
X_train = train.drop(columns=["survived"])
y_train = train.survived

X_validate = validate.drop(columns=["survived"])
y_validate = validate.survived

X_test = test.drop(columns=["survived"])
y_test = test.survived

In [11]:
y_train[0:10]

583    0
165    1
50     0
259    1
306    1
308    0
314    0
883    0
459    0
180    0
Name: survived, dtype: int64

In [12]:
train.survived.value_counts()

0    307
1    191
Name: survived, dtype: int64

In [13]:
base = y_train.mode()
base_prediction = (y_train == 0)
base_accuracy = base_prediction.mean()

round (base_accuracy, 2)

0.62

In [14]:
TP = 233
TN = 109
FP = 81
FN = 468

In [15]:
accuracy = (TP+TN)/(TP + TN + FN + FP)
precision = TP / (TP + FP)
recall = TP / (TP + FN)

print ('The accuracy is ' , accuracy)
print('the precision is ', precision)
print ('the recall is ' , recall)

The accuracy is  0.3838383838383838
the precision is  0.7420382165605095
the recall is  0.33238231098430815

# question 2

In [18]:
# Make the model
tree1 = DecisionTreeClassifier(max_depth=1, random_state=123)

# Fit the model (on train and only train)
tree1 = tree1.fit(X_train, y_train)

# Use the model
# We'll evaluate the model's performance on train, first
y_predictions = tree1.predict(X_train)

In [20]:
print('Accuracy of Decision Tree classifier on training set: {:.2f}'
      .format(tree1.score(X_train, y_train)))

Accuracy of Decision Tree classifier on training set: 0.80